#+TITLE: Aula5

#+begin_src C :include <stdio.h> :results verbatim
int main(){
    printf("%d\n",3|1);
    printf("%d\n",4|2);//note que aqui é comparação bitwise
    printf("%d",4||1);// e aqui é booleana
}
#+end_src

#+RESULTS:
: 3
: 6
: 1

#+begin_src C :include <stdio.h> :results verbatim
int main(){
    int i, N, vi;
    int somatorio = 0;
    float media;

}
#+end_src
